{
  "added_tokens_decoder": {
    "0": {
      "content": "<s>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "1": {
      "content": "<pad>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "2": {
      "content": "</s>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "3": {
      "content": "<unk>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "auto_map": {
    "AutoTokenizer": [
      "ai4bharat/indictrans2-en-indic-dist-200M--tokenization_indictrans.IndicTransTokenizer",
      null
    ]
  },
  "bos_token": "<s>",
  "clean_up_tokenization_spaces": true,
  "do_lower_case": false,
  "eos_token": "</s>",
  "model_max_length": 256,
  "pad_token": "<pad>",
  "src_vocab_file": "E:\\New folder\\sevanagpt\\indictrans\\models\\models--ai4bharat--indictrans2-en-indic-dist-200M\\snapshots\\173b94239f7c38886b2747b8d4a5db771a7e1232\\dict.SRC.json",
  "tgt_vocab_file": "E:\\New folder\\sevanagpt\\indictrans\\models\\models--ai4bharat--indictrans2-en-indic-dist-200M\\snapshots\\173b94239f7c38886b2747b8d4a5db771a7e1232\\dict.TGT.json",
  "tokenizer_class": "IndicTransTokenizer",
  "unk_token": "<unk>"
}
